Repository: 84000/data-translation-memory
Catalog: Toh_134-The_Absorption_That_Encapsulates_All_Merit-v2.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པར་གྲགས་པའི་རྒྱལ་པོ་དེ་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱ་དང་ཐབས་ཅིག་ཏུ་དེ་ནས་མི་སྣང་བར་གྱུར་ནས
en: the Thus-Gone One Immaculately Renowned King immediately vanished from that realm along with five hundred bodhisattvas.

source: དྲང་སྲོང་ཆེན་པོ་མཆོག་གི་མདུན་དུ་བཞུགས་ཏེ།
en: they appeared before the great sage Supreme One.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དྲི་མ་མེད་པར་གྲགས་པའི་རྒྱལ་པོ་དེ་བྱུང་མ་ཐག་ཏུ་དེའི་མོད་ལ་ནགས་ཁུང་དེ་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །མེ་ཏོག་གི་ཆར་ཆེན་པོ་ཡང་བབ་བོ། །
en: As soon as the Blessed One, thus-gone one, the foe-destroyer, the completely perfect Buddha Immaculately Renowned King appeared there, the woods were instantaneously filled with an immense glow, and a rain of flowers fell.

source: དེའི་ཚེ་ནགས་ཁུང་དེ་ན་ཤིང་གི་ཡལ་ག་དང་། ལོ་མ་དང་། མགོ་ལྕོགས་དང་། མེ་ཏོག་དང་། འབྲས་བུ་ཐམས་ཅད་ལས་ཆོས་སྟོན་པའི་སྒྲ་དག་བྱུང་ངོ་། །
en: At the same time, the sound of Dharma teachings rang out from all the branches, leaves, flowers, and fruits in the forest.

source: དེའི་ཚེ་ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་འདུས་པར་གྱུར་ཏོ། །
en: At the same time, many trillions of gods assembled.

source: དེ་ནས་དྲང་སྲོང་ཆེན་པོ་མཆོག་ལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པར་གྲགས་པའི་རྒྱལ་པོ་དེའི་འོད་ཀྱིས་ཕོག་མ་ཐག་ཏུ། དེ་ནས་དེའི་མོད་ལ་ཁ་དོག་དང་གཟུགས་སྔ་མཁོ་བཞིན་དུ་གྱུར་ཏེརྨ་དང་སྣད་པ་མེད་པར་གྱུར་ཏོ། །
en: “As soon as the glow from the Blessed One, the thus-gone one Immaculately Renowned King struck the great sage Supreme One, his wounds and gashes disappeared, and his body and complexion were restored to their normal state.

source: དེ་ནས་དྲང་སྲོང་ཆེན་པོ་མཆོག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས།
en: Then the great sage Supreme One bowed his head to the feet of the Blessed One, the thus-gone one, the foe-destroyer, the completely perfect Buddha known as Immaculately Renowned King.

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ་སོར་མོ་བཅུའི་ཐལ་མོ་སྦྱར་བ་སྤྱི་བོར་བཞག་ནས་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པར་གྲགས་པའི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He circumambulated the Blessed One three times and then, putting his palms together above his head, all ten fingers touching each other, he said to the Thus-Gone One Immaculately Renowned King,

source: བཅོམ་ལྡན་འདས་ནི་བདག་གི་སྟོན་པ་ལགས་སོ། །བདེ་བར་གཤེགས་པ་ནི་བདག་གི་སྟོན་པ་ལགས་སོ། །
en: ‘I take the Blessed One as my guide. I take the Blissful One as my guide.

source: བདག་ནི་བཅོམ་ལྡན་འདས་དང་། ཆོས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིའོ། །
en: I take refuge in the Blessed One, the Dharma, and the Saṅgha of monks.

source: ཅི་ནས་བདག་གིས་ཆོས་ཐོས་ནས་ལོག་པར་ཞུགས་པའི་སེམས་ཅན་ལྟ་བར་གྱུར་པའི་གླག་གླག་པ་སྤྱོད་ཡུལ་བ་རྣམས་ཀྱི་ལོག་པར་ལྟ་བའི་མུན་པ་བསལ་ནསཡང་དག་པའི་ལྟ་བའི་ཆོས་སྟོན་པར་འགྱུར་བར་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་ཆོས་བསྟན་དུ་གསོལ།
en: Blessed one, please teach me the Dharma, and by any means, I will learn it and thereby dispel the darkness of wrong views of misguided beings with faulty views, becoming myself a teacher of the Dharma of the genuine view.

source: བདེ་བར་གཤེགས་པས་བདག་ལ་ཆོས་བསྟན་དུ་གསོལ།
en: Blissful One, please teach me the Dharma!’

source: རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པར་གྲགས་པའི་རྒྱལ་པོ་དེས་དྲང་སྲོང་ཆེན་པོ་མཆོག་གཙོ་བོར་མཛད་ནས་ལྷའི་བུ་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་ཉིད་ལས་བརྩམས་ཏེ
en: “It was then, son of noble family, that the Thus-Gone One Immaculately Renowned King gave a teaching that commenced with this absorption that encapsulates all merit for those gods and bodhisattvas, with the great sage Supreme One at their head.

source: ཅི་ནས་ལྷའི་བུའི་འཁོར་དེའི་ནང་ནས་སྔོན་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྦྱངས་པའི་ལྷའི་བུ་བརྒྱད་སྟོང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་འགྱུར་བ་དང་།
en: Among the audience of gods, there were eight thousand who had previously refined the roots of virtue, who now formed the resolve set on unsurpassed and completely perfect awakening.

source: དྲང་སྲོང་ཆེན་པོ་མཆོག་དེ་ཡང་དགའ་བ་དང་། དང་བ་དང་། མཆོག་ཏུ་དགའ་བ་རྒྱ་ཆེན་པོ་དང་། སྤོབས་པ་མི་ཆོད་པ་ཐོབ་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་བསྟན་ཏོ།། །།
en: The great sage Supreme One himself felt tremendous happiness, delight, and elation, and achieved indestructible courage. Such was the teaching that was given.

source: བཅོམ་ལྡན་འདས་དེས་རྡོ་རྗེའི་ཚིག་བརྒྱད་པོ་འདི་དག་ཀྱང་བསྟན་ཏེ།
en: “That Blessed One then also taught the following eight adamantine statements:

source: ཆོས་ཐམས་ཅད་ནི་ཉོན་མོངས་པ་དང་བྲལ་བའི་ཕྱིར་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པའོ། །
en: ‘All phenomena are devoid of afflictions and thus pure.

source: ཆོས་ཐམས་ཅད་ནི་ཟག་པ་ཐམས་ཅད་ཡོངས་སུ་ཆད་པའི་ཕྱིར་ཟག་པ་མེད་པའོ། །
en: ‘All phenomena are completely bereft of all defilements and thus undefiled.

source: ཆོས་ཐམས་ཅད་ནི་གནས་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པའི་ཕྱིར་གནས་མེད་པའོ། །
en: ‘All phenomena are genuinely beyond any basis and thus baseless.

source: ཆོས་ཐམས་ཅད་ནི་གཉིས་སུ་མེད་པའི་ཕྱིར་སྒོ་མེད་པའོ། །
en: ‘All phenomena are nondual and thus without gateway.

source: ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་ཐར་པའི་སྒོ་ཀུན་ནས་སྟོན་པའི་ཕྱིར་ཀུན་ནས་སྒོའོ། །
en: ‘All phenomena have been shown in all ways to be gateways to liberation and are thus gateways in all ways.

source: ཆོས་ཐམས་ཅད་ནི་འགྲོ་བ་མེད་པའི་ཚུལ་གྱིས་འཕོ་བ་མེད་པའོ། །
en: ‘All phenomena are without going and thus without transference.

source: ཆོས་ཐམས་ཅད་ནི་འགྲོ་བ་ཐམས་ཅད་ཡང་དག་པར་ཆད་པའི་ཕྱིར་འགྲོ་བ་མེད་པའོ། །
en: ‘All phenomena are entirely bereft of all going and thus without going.

source: ཆོས་ཐམས་ཅད་ནི་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བ་གཉིས་སུ་དབྱེར་མེད་པའི་ཕྱིར་དུས་གསུམ་མཉམ་པ་སྟེ།
en: ‘All phenomena are indivisible into past, present, and future, and thus are the equality of the three times.’

source: རྡོ་རྗེའི་ཚིག་བརྒྱད་པོ་དེ་དག་ནི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པར་གྲགས་པའི་རྒྱལ་པོ་དེས། ཆོས་ཐམས་ཅད་ངེས་པར་འབྱེད་པའི་ཕྱིར་བསྟན་ཏོ། །
en: “The blessed one Immaculately Renowned King taught these eight adamantine statements so that all phenomena may be ascertained.

source: མཆོག་གཞན་ཡང་ཆོས་ཀྱི་སྒོའི་ཚིག་བརྒྱད་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡིད་རྟུལ་བར་མི་འགྱུར་བ་སྟེ།
en: “Similarly excellent are these eight statements on the gateways to dharmas so that bodhisattva great beings do not become dullwitted:

source: མིང་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། སྒོ་སྣ་ཚོགས་རྣམ་པར་གཞག་པའི་ཕྱིར་རོ། །
en: ‘Naming them is a gateway to all phenomena, because it establishes all kinds of gateways.

source: སྒྲ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ངག་ཐ་དད་པར་བརྗོད་པའི་ཕྱིར་རོ། །
en: ‘Words are a gateway to all dharmas because they are uttered by different voices.

source: བརྡ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་ཐམས་ཅད་མངོན་པར་ཞེན་པ་མེད་པའི་ཕྱིར་རོ། །
en: ‘Signs are a gateway to all dharmas because all phenomena are beyond fixation.

source: རྣམ་པར་རིག་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། གསོ་བ་དང་། གསོག་དང་། ཡ་མ་བརླ་ཡིན་པའི་ཕྱིར་རོ། །
en: ‘Their cognition is a gateway to all dharmas because they are hollow, empty, and void.

source: བདག་གི་ངོ་བོ་ཉིད་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། བདག་གི་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར་རོ། །
en: ‘Their essential self-existence is a gateway to all dharmas because they have no essential self-existence.

source: ཟད་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཡོད་པ་མ་ཡིན་པའི་ཕྱིར་རོ། །
en: ‘Their exhaustion is a gateway to all dharmas because it is the absence of anything.

source: གདགས་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། གདགས་པ་འབྱུང་བ་མེད་པའི་ཕྱིར་རོ། །
en: ‘Imputations are a gateway to all dharmas because imputations do not arise.

source: མཉམ་པ་ཉིད་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། རོ་གཅིག་པའི་ཕྱིར་རོ། །
en: ‘Their sameness is a gateway to all dharmas because it is their single taste.’

source: མཆོག་ཆོས་ཀྱི་སྒོའི་ཚིག་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡིད་རྟུལ་བར་མི་འགྱུར་བའོ། །
en: “These supreme statements on the gateways to dharmas are taught so that bodhisattva great beings do not become dullwitted.

source: མཆོག་གཞན་ཡང་ས་བོན་གྱི་ཚིག་བརྒྱད་པོ་འདི་དག་ནི་སྤོབས་པ་མི་ཟད་པར་འགྱུར་བ་སྟེ།
en: “Similarly excellent are these eight seed phrases, which lead to inexhaustible eloquence:

source: མཆོག་ཨ་ཞེས་བྱ་བ་ས་བོན་གྱི་ཚིག་ནི་ཆོས་ཐམས་ཅད་གཟོད་མ་ནས་མ་སྐྱེས་པར་སྟོན་ཏོ། །
en: ‘The seed phrase supreme a teaches how all phenomena are primordially non-originating.

source: མཆོག་པ་ཞེས་བྱ་བ་ས་བོན་གྱི་ཚིག་ནི་ཆོས་ཐམས་ཅད་དོན་དམ་པར་སྟོན་ཏོ། །
en: ‘The seed phrase supreme pa teaches all phenomena from the ultimate perspective.

source: མཆོག་ན་ཞེས་བྱ་བ་ས་བོན་གྱི་ཚིག་ནི་ཆོས་ཐམས་ཅད་ཀྱི་མིང་དང་གཟུགས་ཡོངས་སུ་ཤེས་པར་སྟོན་ཏོ། །
en: ‘The seed phrase supreme na teaches the comprehension of the name and form of all phenomena.

source: མཆོག་ད་ཞེས་བྱ་བ་ས་བོན་གྱི་ཚིག་ནི་ཆོས་ཐམས་ཅད་དུལ་བ་དང་ཞི་བར་སྟོན་ཏོ། །
en: ‘The seed phrase supreme da teaches the calming and pacification of all phenomena.

source: མཆོག་ས་ཞེས་བྱ་བ་ས་བོན་གྱི་ཚིག་ནི་ཆོས་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པར་སྟོན་ཏོ། །
en: ‘The seed phrase supreme sa teaches transcendence of all phenomena.

source: མཆོག་ཏ་ཞེས་བྱ་བ་ས་བོན་གྱི་ཚིག་ནི་ཆོས་ཐམས་ཅད་དེ་བཞིན་ཉིད་དུ་དབྱེར་མེད་པར་སྟོན་ཏོ། །
en: ‘The seed phrase supreme ta teaches the indivisibility of all phenomena within suchness.

source: མཆོག་ཀ་ཞེས་བྱ་བ་ས་བོན་གྱི་ཚིག་ནི་ཆོས་ཐམས་ཅད་ཟད་པ་ཉིད་དུ་སྟོན་ཏོ། །
en: ‘The seed phrase supreme ka teaches the exhaustion of all phenomena.

source: མཆོག་མ་ཞེས་བྱ་བ་ས་བོན་གྱི་ཚིག་ནི་ཆོས་ཐམས་ཅད་དབུས་དང་མཐའ་ཡོངས་སུ་ཆད་པར་སྟོན་ཏོ། །
en: ‘The seed phrase supreme ma teaches the way all phenomena are bereft of middle and extremes.’

source: མཆོག་ས་བོན་གྱི་ཚིག་བརྒྱད་པོ་དེ་དག་ནི་སྤོབས་པ་མི་ཟད་པར་འགྱུར་བའོ། །
en: “These eight supreme seed phrases lead to inexhaustible eloquence.

source: དེ་ལྟ་བས་ན་ས་བོན་གྱི་ཚིག་འདི་དག་དང་། ཆོས་ཀྱི་སྒོའི་ཚིག་འདི་དག་དང་། རྡོ་རྗེའི་ཚིག་འདི་དག་ལ་དྲན་པ་དང་། ཤེས་བཞིན་དུ་སྤྱོད་པ་མཉམ་པ་ཉིད་ལ་བརྩོན་པར་བྱའོ། །
en: “Thus one should endeavor in equanimity and with mindfulness and awareness to apply these eight seed phrases, eight statements on the gateways to dharmas, and eight adamantine statements.

source: རྟག་ཏུ་འདུ་འཛི་མེད་པར་སྤྱོད་པས་ཚུལ་བཞིན་དུ་སོ་སོར་བརྟག་པ་ལ་བརྩོན་པར་བྱའོ། །
en: One should endeavor in correct discernment with behavior that is never frivolous.

source: རྟག་ཏུ་དགེ་བ་གང་ཡིན་ཞེས་ཚོལ་ཞིང་འདོད་པ་ལ་བརྩོན་པར་བྱའོ། །
en: And one should endeavor always to seek and pursue what is wholesome.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པར་གྲགས་པའི་རྒྱལ་པོ་དེས་ཆོས་ཀྱི་ཚིག་ཞུས་པ་དེ་དག་གི་ལན་བཏབ་ནས།
en: “Son of noble family, this was the way the Blessed One, the thus-gone one Immaculately Renowned King responded to the request for statements about the Dharma.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་སྣང་བར་མཛད་ཅིང་རབ་ཏུ་གཡོས་པར་མཛད་ནས།
en: In doing so, he illuminated and sent tremors through the world system.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་ཐབས་ཅིག་ཏུ་མི་སྣང་བར་གྱུར་ཏེ། སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་བཞུགས་པར་གྱུར་ཏོ། །
en: He then vanished along with the bodhisattvas, only to reappear at the same moment, the same instant, the same second, in his own buddhafield.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་ཀྱང་གང་དུ་ཡང་གཤེགས་པའམ་སླར་གཤེགས་པར་མངོན་པ་མེད་དོ། །
en: There was no sign of him leaving from or arriving in those buddhafields.

source: རིགས་ཀྱི་བུ་དེ་ནས་དྲང་སྲོང་ཆེན་པོ་མཆོག་དེ་སྤོབས་པ་མི་ཆོད་པ་དང་ལྡན་པར་གྱུར་ཏེ།
en: “Son of noble family, on that occasion, the great sage Supreme One achieved indestructible eloquence.

source: བརྗེད་ངས་པ་མེད་པའི་དྲན་པ་དེ་དང་ཡང་ལྡན་པར་གྱུར་ནས་ལྷས་ཡོངས་སུ་བཟུང་བ་ཐོབ་པར་གྱུར་ཏོ། །
en: Attaining perfect recall as well, he obtained the protection of the deities.

source: ལྷས་ཡོངས་སུ་བཟུང་བ་དེས་ན་བདུད་ཕྱིར་རྒོལ་བ་ཡང་ཆོམས་ནས་གྲོང་དང་།
en: Protected by the deities, he was able to subdue hostile demonic forces.

source: གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་དུ་སོང་ནས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ།
en: And so he traveled through various villages, cities, towns, countries, kingdoms, and palaces, teaching the Dharma to others. In this way,

source: བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་ཉིད་རྒྱས་པར་བཤད་ཅིང་རབ་ཏུ་བསྟན་ཏོ། །
en: he elucidated and expounded extensively on this absorption that encapsulates all merit.

source: དེས་ལོ་སྟོང་ཐམ་པར་ཆོས་བསྟན་ཏེ།
en: “For one thousand years he taught the Dharma.

source: སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་ནི་ཉན་ཐོས་སུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: He matured 84,000 beings to the level of śrāvaka,

source: སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་ནི་རང་སངས་རྒྱས་སུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: 84,000 beings to the level of solitary buddha,

source: སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: 84,000 beings to the level of unsurpassed and completely perfect awakening,

source: སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་ནི་འཁོར་ལོས་སྒྱུར་བར་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: 84,000 beings to the level of wheel-bearing monarch,

source: སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་ནི་བརྒྱ་བྱིན་དུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: 84,000 beings to the level of Śakra, and

source: སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་ནི་ཚངས་པར་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: 84,000 beings to the level of Brahmā.

source: སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་ནི་བྱམས་པ་བསྒོམ་པ་ལ་བཀོད་དོ། །
en: He established 84,000 beings in the meditation of love,

source: སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་ནི་སྙིང་རྗེ་བསྒོམ་པ་ལ་བཀོད་དོ། །
en: 84,000 beings in the meditation of compassion,

source: སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་ནི་དགའ་བ་བསྒོམ་པ་ལ་བཀོད་དོ། །
en: 84,000 beings in the meditation of joy, and

source: སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་ནི་བཏང་སྙོམས་བསྒོམ་པ་ལ་བཀོད་དོ། །
en: 84,000 beings in the meditation of equanimity.

source: སྲོག་ཆགས་དཔག་ཏུ་མེད་པ་ཞིག་ནི་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་ཉེ་བར་འགྲོ་བར་བྱས་སོ། །
en: He led an unfathomable number of beings to advance to the higher realms.

source: དེའི་འོག་ཏུ་དྲང་སྲོང་ཆེན་པོ་མཆོག་དེ་ཤི་ནས་
en: Eventually, when the great sage Supreme One passed away,

source: ལྷའི་བུ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དྲི་མ་མེད་པར་གྲགས་པའི་རྒྱལ་པོ་དེ་ཉིད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཀུན་ནས་དྲི་མ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སྐྱེས་སོ། །
en: he and 84,000 gods were reborn together in the Totally Immaculate world system, the buddhafield of the thus-gone one, the foe-destroyer, the completely perfect buddha Immaculately Renowned King.

source: རིགས་ཀྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཆེན་པོ་མཆོག་དེ་གཞན་ཞིག་ཡིན་པར་ཁྱོད་སོམ་ཉིའམ་ཡིད་གཉིས་སམ། ཐེ་ཙོམ་ཟན་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ། །
en: “ Son of noble family, in case you have hesitations, reservations, or doubt that Great Supreme Sage might be someone else, do not harbor them.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཆེན་པོ་མཆོག་ཏུ་གྱུར་ཏེ།
en: Because it was I who at that time, in those days, was the great sage Supreme One.

source: ངས་ཆོས་འདོད་པ་དང་། ཆོས་ལ་གུས་པར་གནས་པའི་བདེན་པའི་བྱིན་གྱི་རླབས་དེས་འོག་གི་ཕྱོགས་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པར་གྲགས་པའི་རྒྱལ་པོ་དེ་སྤྱན་དྲངས་སོ། །
en: It was through the blessing of my truthful resolve—my desire and devotion for the Dharma—that the blessed one, the thus-gone one Immaculately Renowned King was invoked from that buddhafield below.

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་རྣམ་གྲངས་དེས་ཀྱང་ཁྱོད་ཀྱིས་ཆོས་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ནི་ནམས་ཀྱང་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ལས་འདའ་བར་མི་འགྱུར་ལ། དམ་པའི་ཆོས་ཀྱང་ནུབ་པར་མི་འགྱུར་བ་དེ་ལྟར་རིག་པར་བྱའོ། །
en: “Vimalatejā, you should understand through such accounts that for bodhisattva great beings who yearn for the Dharma, the thus-gone ones do not pass beyond suffering, nor does the sacred Dharma ever disappear.

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཆོས་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་པ་ཕུན་སུམ་ཚོགས་པ་གུས་པ་དང་བཅས་པ་རྣམས་ནི་འཇིག་རྟེན་གྱི་ཁམས་གཞན་ན་འདུག་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཞལ་སྟོན་པར་མཛད་ཅིང་ཆོས་ཀྱང་ཐོས་པར་མཛད་དོ། །
en: Vimalatejā, bodhisattva great beings who yearn for the Dharma with perfect motivation and devotion cause the blessed buddhas to manifest and teach the Dharma, even though they may dwell in a different world system.

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཆོས་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཆོས་ཀྱི་གཏེར་རི་དང་། རི་སུལ་དང་། ཤིང་དག་གི་ནང་དུ་བཅུག་པ་དག་ཡོད་དེ
en: Vimalatejā, the Dharma treasures of bodhisattva great beings who yearn for the Dharma are found within mountains, mountain caverns, and trees.

source: གཟུངས་དང་། ཆོས་ཀྱི་སྒོ་མཐའ་ཡས་པ་གླེགས་བམ་དུ་བྱས་པ་དག་ཀྱང་ལག་ཏུ་འོང་བར་འགྱུར་རོ། །
en: They contain incantations and infinite gateways to the doctrine laid out in tomes yet to be discovered.

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཆོས་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ནི་སྔོན་སངས་རྒྱས་མཐོང་བའི་ལྷ་རྣམས་སྤོབས་པ་སྒྲུབ་པར་བྱེད་དོ། །
en: “Vimalatejā, to bodhisattva great beings who yearn for the Dharma, divine beings who have beheld previous buddhas grant courage.

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཆོས་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ཚེ་ཟད་ན་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། ལྷ་རྣམས་ཀྱིས་ཚེ་དང་སྟོབས་སྒྲུབ་པར་བྱེད་དེ
en: Vimalatejā, when the lifespan of bodhisattva great beings who yearn for the Dharma comes to an end, the blessed buddhas and gods can grant them lifespan and power.

source: སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་དང་། ལྷའི་བྱིན་གྱི་རླབས་ཀྱིས་དེ་དག་འདོད་ན་ལོ་སྟོང་དུ་ཡང་འཁོད་དོ། །
en: If they wish, through the buddhas’ and gods’ blessings, they can live for a thousand years,

source: ལོ་འབུམ་ཕྲག་གཉིས་སམ། གསུམ་མམ། བཞིའམ། ལྔའི་བར་དུ་ཡང་འཁོད་པ་ནས།
en: or even two, three, four, or five hundred thousand years—

source: བསྐལ་པའམ། བསྐལ་པ་ལས་ལྷག་པའམ། ཡང་ན་ཇི་སྲིད་འདོད་པའི་བར་དུ་ཡང་འཁོད་དོ། །
en: or even for an eon, or longer than an eon, for as long as they might desire.

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཆོས་ལ་གུས་པ་སྐྱེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་རྒ་བ་ཡང་སེལ་བར་མཛད་དོ། །ནད་ཀྱང་སེལ་བར་མཛད་དོ། །
en: “Vimalatejā, for bodhisattva great beings who have engendered devotion to the Dharma, the blessed buddhas even eliminate aging and sickness.

source: དྲན་པ་ཡང་བསྒྲུབ་པར་མཛད་དོ། །
en: They endow them with recollection,

source: རྟོགས་པ་དང་སྤོབས་པ་ཡང་བསྒྲུབ་པར་མཛད་དོ། །
en: and endow them with realization and eloquence as well.

source: ཆོས་ལ་གུས་པ་སྐྱེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལྟ་བར་གྱུར་པ་རྣམས་ནི་སེལ་བར་མཛད་ལ། ཡང་དག་པའི་ལྟ་བ་ནི་བསྒྲུབ་པར་མཛད་དོ། །
en: The blessed buddhas also eradicate any viewpoints that bodhisattva great beings who have engendered devotion to the Dharma might have, and endow them with the genuine view instead.

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཆོས་ལ་གུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་གཞན་གྱི་གནོད་པ་ཐམས་ཅད་འབྱུང་བར་མི་འགྱུར་རོ། །
en: Vimalatejā, bodhisattva great beings who have engendered devotion to the Dharma cannot be harmed in any way by others.

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཐོས་པའི་ཚོགས་ལ་མཁས་པ་ལ་བརྩོན་པར་བྱའོ། །
en: “In the light of this, Vimalatejā, bodhisattva great beings should endeavor to gain expertise in the accumulation of learning.

source: ཐོས་པའི་ཚོགས་ལ་མཁས་པ་ལ་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ཡོན་ཏན་གྱི་ཁྱད་པར་དེ་ལྟ་བུ་དག་འབྱུང་བར་འགྱུར་བའམ། ཡང་ན་དེ་བས་ཀྱང་གོང་མའམ། དེ་བས་ཀྱང་ལྷག་པར་འགྱུར་ཏེ
en: Bodhisattva great beings who endeavor to gain expertise in the accumulation of learning will attain such extraordinary qualities as these—or even greater and better than these.

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་གསུམ་པོ་འདི་དག་ནི་བསོད་ནམས་ཉེ་བར་རྟོན་པ་དང་། བསོད་ནམས་ཀྱི་ཚོགས་དང་། བསོད་ནམས་འབྱུང་བ་དང་། བསོད་ནམས་རྒྱས་པ་དང་། བསོད་ནམས་ཀྱི་རྒྱུ་འཐུན་པ་དང་། བསོད་ནམས་མི་ཟད་པ་དང་། བསོད་ནམས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བསོད་ནམས་རྒྱ་མཚོ་ཡིན་ཏེ
en: “Vimalatejā, these three practices constitute the foundation of merit, the accumulation of merit, the emergence of merit, the expansion of merit, the outflow of merit, inexhaustible merit, inconceivable merit, an ocean of merit.

source: དེ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་གི་བསོད་ནམས་རྣམས་ཀྱི་མཐའ་འམ་ཚད་ནི་རྟོགས་པར་མི་ནུས་སོ། །
en: The magnitude or measure of the merit of those bodhisattva great beings who live by them is beyond comprehension.

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་རྒྱ་མཚོ་ཆེན་པོའི་ཐིགས་པ་རྣམས་ཀྱི་ཚད་དང་མཐའ་ནི་རྟོགས་པར་ནུས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྦྱིན་པའི་ཚོགས་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་དང་། ཐོས་པའི་ཚོགས་བསགས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོའི་ཚད་དང་མཐའ་ནི་རྟོགས་པར་མི་ནུས་སོ། །
en: Vimalatejā, the magnitude or measure of the drops of water in the ocean could indeed be reached. However, the quantity of merit of bodhisattva great beings’ accumulation of generosity, discipline, and learning defies comprehension in terms of magnitude and measure.

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་ས་ལ་རི་དང་། ཤིང་ལྗོན་པ་དང་། ནགས་ཚལ་དང་། རྩྭ་ཡོད་པ་ཐམས་ཅད་ནི་སྲང་ཚད་ཀྱིས་ཚད་དང་མཐའ་རྟོགས་པའམ་ཤེས་པར་ནུས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྦྱིན་པའི་ཚོགས་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་དང་། ཐོས་པའི་ཚོགས་བསགས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི་ཚད་གཟུང་བར་མི་ནུས་སོ་ཞེས་ང་སྨྲའོ། །
en: Vimalatejā, one could reach and identify the magnitude and measure of the weight of all the mountains, trees, forests, and grass on earth within the trichiliocosm. However, I assure you that the quantity of merit gathered in the bodhisattva great beings’ accumulation of generosity, discipline, and learning could not be measured.”

source: བཅོམ་ལྡན་འདས་ཚོགས་གསུམ་པོ་སྦྱིན་པའི་ཚོགས་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་དང་། ཐོས་པའི་ཚོགས་དེ་དག་གི་ནང་ན་ཚོགས་གང་ཆེས་མཆོག་དང་། ཆེས་གཙོ་བོ་ལགས།
en: “Blessed One, of these three accumulations—the accumulation of generosity, the accumulation of discipline, and the accumulation of learning—which is superior, which is foremost?”

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཚོགས་གསུམ་པོ་སྦྱིན་པའི་ཚོགས་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་དང་། ཐོས་པའི་ཚོགས་དེ་དག་གི་ནང་ན་ཐོས་པའི་ཚོགས་འབའ་ཞིག་མཆོག་ཅེས་བྱ།
en: “Vimalatejā, of the three accumulations—of generosity, discipline, and learning—it is the accumulation of learning alone that is regarded as superior,

source: རབ་ཅེས་བྱ།
en: eminent,

source: རབ་མཆོག་ཅེས་བྱ།
en: preeminent,

source: གྱ་ནོམ་པ་ཞེས་བྱ།
en: consummate,

source: གཙོ་བོ་ཞེས་བྱ།
en: foremost,

source: ཁྱད་པར་དུ་འཕགས་པ་ཞེས་བྱ།
en: extraordinary,

source: བླ་མ་ཞེས་བྱ།
en: paramount,

source: བླ་ན་མེད་པ་ཞེས་བྱ།
en: unsurpassed,

source: གོང་ན་མེད་པ་ཞེས་བྱ།
en: unexcelled,

source: གོང་མའི་ཡང་གོང་མ་ཞེས་བྱའོ། །
en: and the most prominent of all.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རིའི་རྒྱལ་པོ་རི་རབ་ཀྱི་མདུན་ན་ཡུངས་འབྲུ་གཅིག་འདུག་པ་བཞིན་དུ་སྦྱིན་པའི་ཚོགས་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་ཀྱང་དེ་དང་འདྲ་བར་བལྟ་བར་བྱའོ། །རིའི་རྒྱལ་པོ་རི་རབ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ནི་ཐོས་པའི་ཚོགས་བལྟ་བར་བྱའོ། །
en: Son of noble family, you can think of the accumulations of generosity and discipline as analogous to a mustard seed, and the accumulation of learning as having the size of Mount Meru, king of mountains.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ལ་བྱའི་རྗེས་ཇི་ལྟ་བ་བཞིན་དུ་སྦྱིན་པའི་ཚོགས་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་ཀྱང་དེ་དང་འདྲ་བར་བལྟ་བར་བྱའོ། །
en: Son of noble family, you can also consider the accumulations of generosity and discipline as analogous to the trails of birds in the sky,

source: ཕྱོགས་བཅུའི་ནམ་མཁའ་མཐའ་ཡས་པ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ནི་ཐོས་པའི་ཚོགས་བལྟ་བར་བྱའོ། །
en: while the accumulation of learning is like the limitless sky throughout the ten directions.

source: རིགས་ཀྱི་བུ་སྦྱིན་པའི་ཚོགས་ནི་བྱ་བ་གཉིས་བྱེད་དེ།
en: “Son of noble family, the accumulation of generosity fulfills two functions.

source: དབུལ་བ་སེལ་བ་དང་། ལོངས་སྤྱོད་ཆེན་པོ་བསྒྲུབ་པ་སྟེ་བྱ་བ་འདི་གཉིས་བྱེད་དོ། །
en: It alleviates poverty and creates prosperity.

source: ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་ཀྱང་བྱ་བ་གཉིས་བྱེད་དེ།
en: The accumulation of discipline also fulfills two functions.

source: གཉིས་གང་ཞེ་ན་
en: What are those two functions?

source: ངན་འགྲོ་སེལ་བ་དང་། བདེ་འགྲོ་བསྒྲུབ་པ་སྟེ་བྱ་བ་འདི་གཉིས་བྱེད་དོ། །
en: It counteracts the lower states and brings about the higher states.

source: ཤེས་རབ་ཀྱི་ཚོགས་ཀྱང་བྱ་བ་གཉིས་བྱེད་དེ།
en: The accumulation of insight fulfills two functions as well.
